
&После("ПриПодготовкеНабораДанных")
Процедура ДвиженияДокумента_3_0_3_298_ПриПодготовкеНабораДанных(Документ, НаборыДанных)
	
	Для каждого НаборДанных Из НаборыДанных Цикл
		
		ДополнитьТекстЗапросаНабораДанных(НаборДанных);
		
	КонецЦикла
	
КонецПроцедуры

Процедура ДополнитьТекстЗапросаНабораДанных(НаборДанных)
	
	СтрокиДополнения = Новый Массив;
	СтрокиДополнения.Добавить(Символы.Таб + "НомерСтроки");
	ДобавитьСтрокиДополнения(СтрокиДополнения, НаборДанных.СтандартныеРеквизиты);
	ДобавитьСтрокиДополнения(СтрокиДополнения, НаборДанных.Измерения);
	
	ТекстДополнения = НСтр("ru = 'УПОРЯДОЧИТЬ ПО'") + Символы.ПС
		+ СтрСоединить(СтрокиДополнения, "," + Символы.ПС);
	НаборДанных.ТекстЗапроса = НаборДанных.ТекстЗапроса + Символы.ПС + ТекстДополнения;
	
КонецПроцедуры

Процедура ДобавитьСтрокиДополнения(СтрокиДополнения, Реквизиты)
	
	Для каждого Реквизит Из Реквизиты Цикл
		
		СтрокиДополнения.Добавить(Символы.Таб + Реквизит.Ключ);
		
	КонецЦикла;
	
КонецПроцедуры